---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DuctFailures.PartNotFoundDueToNoDuctConnectedError
source: html/8949287f-d3c9-d430-06d7-07cf25c09d38.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DuctFailures.PartNotFoundDueToNoDuctConnectedError Property

"In order to find a matching part, the fitting has to be connected to a duct."

## Syntax (C#)
```csharp
public static FailureDefinitionId PartNotFoundDueToNoDuctConnectedError { get; }
```